app/views/users/index.html.erb

    <td colspan="2">合計(人)</td>
    <td><%=User.where(administrator:"1").count %></td>
    <td><%=User.where(administrator:"0").count %></td>
---
SELECT COUNT(*) FROM "users" WHERE "users"."administrator" = ?  [["administrator", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."administrator" = ?  [["administrator", 1]]