app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by(id: session[:user_id])
    if @user && @user.administrator == 1
        @administrator_user = User.find_by(id: session[:user_id])
    elsif @user && @user.administrator == 0
        @current_user = User.find_by(id: session[:user_id])