app/controllers/stamps_controller.rb

SELECT "stamps".* FROM "stamps" WHERE "stamps"."name" = ? AND (date like '%2020-08%') ORDER BY "stamps"."date" DESC  [["name", "test1"]]
SELECT  "stamps".* FROM "stamps" WHERE "stamps"."date" = ? LIMIT ?  [["date", "2020-08-17"], ["LIMIT", 1]]
---
  def index
    @datetime = DateTime.now
    @yymmdd = DateTime.now.to_s(:date)
    @month = @datetime.strftime("%m")
    @year = @datetime.strftime("%Y")
    @date = @year + "-" + @month
    @stamps = Stamp.where(name: @current_user.name).where("date like ?","%#{@date}%").order(date: :desc)
    @stamp = Stamp.find_by(date:@yymmdd)

SELECT "stamps".* FROM "stamps" WHERE "stamps"."name" = ? AND (date like '%2020-08%')  [["name", "test1"]]
---
  def my_search
    @datetime = DateTime.now
    @month = params[:month].to_s
    @year = @datetime.strftime("%Y")
    @date = @year + "-" + @month
    @stamps = Stamp.where(name: @current_user.name).where("date like ?","%#{@date}%")

SELECT "stamps".* FROM "stamps" WHERE "stamps"."date" = ?  [["date", "2020-08-15"]]
---
  def aggregate
    @date = Time.now.strftime("%Y-%m-%d")
    @stamps = Stamp.where(date: @date)

SELECT "stamps".* FROM "stamps" WHERE "stamps"."date" = ? ORDER BY "stamps"."name" ASC  [["date", "2020-08-15"]]
---
  def day_search
    @stamps = Stamp.search(params[:date],params[:name],params[:date_from],params[:date_to]).order(:name)

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."name" = ? AND "stamps"."date" = ? LIMIT ?  [["name", "test1"], ["date", "2020-08-14"], ["LIMIT", 1]]
---
  def name_search
    @stamps = Stamp.search(params[:date],params[:name],params[:date_from],params[:date_to]).order(date: :desc)

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."name" = ? AND "stamps"."date" = ? LIMIT ?  [["name", "test1"], ["date", "2020-08-17"], ["LIMIT", 1]]
UPDATE "stamps" SET "start" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["start", "2020-08-17 20:40:00"], ["updated_at", "2020-08-17 20:40:31.856140"], ["id", 6]]
---
  def create_start
    @today = Time.now.to_s(:date)
    @stamp = Stamp.find_by(name: @current_user.name, date: @today)
    @time = Time.now.to_s

    if @stamp.start == nil
        @stamp.update(start: @time)

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."name" = ? AND "stamps"."date" = ? LIMIT ?  [["name", "test1"], ["date", "2020-08-29"], ["LIMIT", 1]]
UPDATE "stamps" SET "am_finish" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["am_finish", "2020-08-29 09:48:00"], ["updated_at", "2020-08-29 09:48:36.002401"], ["id", 14]]
---
  def create_am_finish
    @today = Time.now.to_s(:date)
    @stamp = Stamp.find_by(name: @current_user.name, date: @today)
    @time = Time.now.to_s

    if @stamp.start  == nil
      flash[:notice] = I18n.t("errors.messages.no_start")
      redirect_to("/index")

    elsif @stamp.am_finish == nil
      @stamp.update(am_finish: @time)

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."name" = ? AND "stamps"."date" = ? LIMIT ?  [["name", "test1"], ["date", "2020-08-17"], ["LIMIT", 1]]
UPDATE "stamps" SET "pm_start" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["pm_start", "2020-08-17 20:40:00"], ["updated_at", "2020-08-17 20:40:33.562653"], ["id", 6]]
---
  def create_pm_start
    @today = Time.now.to_s(:date)
    @stamp = Stamp.find_by(name: @current_user.name, date: @today)
    @time = Time.now.to_s

    if @stamp.start  == nil
      flash[:notice] = I18n.t("errors.messages.no_start")
      redirect_to("/index")

    elsif @stamp.pm_start == nil
      @stamp.update(pm_start: @time)

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."name" = ? AND "stamps"."date" = ? LIMIT ?  [["name", "test1"], ["date", "2020-08-17"], ["LIMIT", 1]]
UPDATE "stamps" SET "finish" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["finish", "2020-08-17 20:52:00"], ["updated_at", "2020-08-17 20:52:06.844841"], ["id", 6]]
---
  def create_finish
    @today = Time.now.to_s(:date)
    @stamp = Stamp.find_by(name: @current_user.name, date: @today)
    @time = Time.now.to_s

    if @stamp.start  == nil
      flash[:notice] = I18n.t("errors.messages.no_start")
      redirect_to("/index")

    elsif @stamp.finish == nil
      @stamp.update(finish: @time)

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."name" = ? AND "stamps"."date" = ? LIMIT ?  [["name", "test1"], ["date", "2020-08-17"], ["LIMIT", 1]]
UPDATE "stamps" SET "memo" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["memo", "残業予定ですよー"], ["updated_at", "2020-08-17 20:42:51.358354"], ["id", 6]]
---
  def create_memo
    @today = Time.now.to_s(:date)
    @stamp = Stamp.find_by(name: @current_user.name, date: @today)

    if params[:memo]
      @stamp.update(memo: params[:memo])

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    @stamp = Stamp.find_by(id: params[:id])

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def start
    @stamp = Stamp.find_by(id: params[:id])

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "stamps" SET "start" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["start", "2020-08-14 12:36:00"], ["updated_at", "2020-08-14 15:50:55.286022"], ["id", 1]]
UPDATE "stamps" SET "am_finish" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["am_finish", "2020-08-13 21:40:00"], ["updated_at", "2020-08-14 06:41:18.121774"], ["id", 1]]
---
  def update_start
    @stamp = Stamp.find_by(id: params[:id])
    @year = @stamp.date.strftime("%Y")
    @month = @stamp.date.strftime("%m")
    @day = @stamp.date.strftime("%d")

    if params[:start] !=""
    @start =  Time.parse(params[:start])
    @starth = @start.hour
    @startm = @start.min
    @p_start = Time.local(@year,@month,@day,@starth,@startm)
    end

    if @p_start&.past?
       @stamp.update(
        start: @p_start
      )
      flash[:notice] = I18n.t("helpers.submit.update")
      redirect_to("/index")

    elsif params[:start] == ""
      @stamp.update(
        start:nil
      )

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def am_finish
    @stamp = Stamp.find_by(id: params[:id])

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "stamps" SET "am_finish" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["am_finish", "2020-08-13 21:40:00"], ["updated_at", "2020-08-14 06:41:18.121774"], ["id", 1]]
UPDATE "stamps" SET "pm_start" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["pm_start", "2020-08-14 01:00:00"], ["updated_at", "2020-08-14 06:41:36.950025"], ["id", 1]]
---
  def update_am_finish
    @stamp = Stamp.find_by(id: params[:id])
    @year = @stamp.date.strftime("%Y")
    @month = @stamp.date.strftime("%m")
    @day = @stamp.date.strftime("%d")

    if params[:am_finish] !=""
    @am_finish =  Time.parse(params[:am_finish])
    @am_finishh = @am_finish.hour
    @am_finishm = @am_finish.min
    @p_am_finish = Time.local(@year,@month,@day,@am_finishh,@am_finishm)
    end

    if @p_am_finish&.past?
       @stamp.update(
        am_finish: @p_am_finish
      )
      flash[:notice] = I18n.t("helpers.submit.update")
      redirect_to("/index")

    elsif params[:am_finish] == ""
      @stamp.update(
        am_finish:nil
      )

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
  def pm_start
    @stamp = Stamp.find_by(id: params[:id])

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "stamps" SET "pm_start" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["pm_start", "2020-09-05 08:48:00"], ["updated_at", "2020-09-05 10:46:18.270842"], ["id", 18]]
UPDATE "stamps" SET "finish" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["finish", "2020-08-14 15:36:00"], ["updated_at", "2020-08-14 15:51:17.464072"], ["id", 1]]
---
  def update_pm_start
    @stamp = Stamp.find_by(id: params[:id])
    @year = @stamp.date.strftime("%Y")
    @month = @stamp.date.strftime("%m")
    @day = @stamp.date.strftime("%d")

    if params[:pm_start] !=""
    @pm_start =  Time.parse(params[:pm_start])
    @pm_starth = @pm_start.hour
    @pm_startm = @pm_start.min
    @p_pm_start = Time.local(@year,@month,@day,@pm_starth,@pm_startm)
    end

    if @p_pm_start&.past?
      @stamp.update(
        pm_start:@p_pm_start
      )
      flash[:notice] = I18n.t("helpers.submit.update")
      redirect_to("/index")

    elsif params[:pm_start] == ""
      @stamp.update(
        pm_start:nil
      )

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def finish
    @stamp = Stamp.find_by(id: params[:id])

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "stamps" SET "finish" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["finish", "2020-08-14 15:36:00"], ["updated_at", "2020-08-14 15:51:17.464072"], ["id", 1]]
---
  def update_finish
    @stamp = Stamp.find_by(id: params[:id])
    @year = @stamp.date.strftime("%Y")
    @month = @stamp.date.strftime("%m")
    @day = @stamp.date.strftime("%d")

    if params[:finish] !=""
    @finish =  Time.parse(params[:finish])
    @finishh = @finish.hour
    @finishm = @finish.min
    @p_finish = Time.local(@year,@month,@day,@finishh,@finishm)
    end

    if @p_finish&.past?
      @stamp.update(
        finish:@p_finish
      )