app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.all.order(created_at: "DESC")

INSERT INTO "users" ("name", "email", "password", "administrator", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test3"], ["email", "test3@vc"], ["password", "test"], ["administrator", 0], ["created_at", "2020-08-15 10:40:53.628588"], ["updated_at", "2020-08-15 10:40:53.628588"]]
---
  def create
    @user=User.new(name: params[:name],
                   email: params[:email],
                   password: params[:password],
                   administrator: params[:administrator])

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$E3LMwr7Y91/Q.eK/cmlf8Og0VFXs.WjVduJS5XERTFzoBw.hL0vA2"], ["updated_at", "2020-08-15 14:45:20.837916"], ["id", 2]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    @user.password = params[:password]

    if @user.save